espressif/arduino-esp32/libraries/BLE/src/BLECharacteristic.cpp
#if defined(CONFIG_NIMBLE_ENABLED)

int BLECharacteristic::handleGATTServerEvent(uint16_t conn_handle, uint16_t attr_handle, struct ble_gatt_access_ctxt *ctxt, void *arg) {
  const ble_uuid_t *uuid;
  int rc;
  struct ble_gap_conn_desc desc;
  BLECharacteristic *pCharacteristic = (BLECharacteristic *)arg;

  log_d("Characteristic %s %s event", pCharacteristic->getUUID().toString().c_str(), ctxt->op == BLE_GATT_ACCESS_OP_READ_CHR ? "Read" : "Write");

  uuid = ctxt->chr->uuid;
  if (ble_uuid_cmp(uuid, &pCharacteristic->getUUID().getNative()->u) == 0) {
    switch (ctxt->op) {
      case BLE_GATT_ACCESS_OP_READ_CHR:
      {
        // Only call the onRead() callback if the buffer length is greater than 0 and conn_handle is not NONE
        // For long reads, follow-up requests will have om_len == 0
        if (ctxt->om->om_len > 0 && conn_handle != BLE_HS_CONN_HANDLE_NONE) {
          rc = ble_gap_conn_find(conn_handle, &desc);
          assert(rc == 0);
          pCharacteristic->m_pCallbacks->onRead(pCharacteristic, &desc);
        }

        portENTER_CRITICAL(&pCharacteristic->m_readMux);
        rc = os_mbuf_append(ctxt->om, (uint8_t *)pCharacteristic->m_value.getValue().c_str(), pCharacteristic->m_value.getValue().length());
        portEXIT_CRITICAL(&pCharacteristic->m_readMux);

        return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
      }

      case BLE_GATT_ACCESS_OP_WRITE_CHR:
      {
        if (ctxt->om->om_len > BLE_ATT_ATTR_MAX_LEN) {
          return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
        }

        uint8_t buf[BLE_ATT_ATTR_MAX_LEN];
        size_t len = ctxt->om->om_len;
        memcpy(buf, ctxt->om->om_data, len);

        os_mbuf *next;
        next = SLIST_NEXT(ctxt->om, om_next);
        while (next != NULL) {
          if ((len + next->om_len) > BLE_ATT_ATTR_MAX_LEN) {
            return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
          }
          memcpy(&buf[len], next->om_data, next->om_len);
          len += next->om_len;
          next = SLIST_NEXT(next, om_next);
        }
        rc = ble_gap_conn_find(conn_handle, &desc);
        assert(rc == 0);
        pCharacteristic->setValue(buf, len);

        // Call the onWrite callback before returning.
        // NOTE: This callback is executed synchronously in the NimBLE GATT access context.
        //       NimBLE sends the write response automatically after this function returns,
        //       based on its return code. As a result, any work performed in onWrite()
        //       directly impacts when the client receives the ATT write acknowledgment.
        //
        // Behavioral change:
        //   In earlier implementations that used a deferred callback mechanism, the write
        //   response was sent before the onWrite() callback executed. Applications that
        //   relied on that behavior (e.g., long-running or blocking onWrite() handlers,
        //   or handlers that perform notify/indicate operations) may now experience
        //   delayed write acknowledgments if onWrite() takes significant time to complete.
        //
        // Recommendation:
        //   Implement onWrite() as a fast, non-blocking callback. Offload long-running
        //   processing to another task or queue to avoid increasing write latency or
        //   causing client timeouts.
        pCharacteristic->m_pCallbacks->onWrite(pCharacteristic, &desc);

        return 0;
      }

      default: break;
    }
  }

  return BLE_ATT_ERR_UNLIKELY;

  //m_descriptorMap.handleGATTServerEvent(conn_handle, attr_handle, ctxt, arg);
}

/**
 * @brief Set the subscribe status for this characteristic.\n
 * This will maintain a vector of subscribed clients and their indicate/notify status.
 */
void BLECharacteristic::setSubscribe(struct ble_gap_event *event) {
  ble_gap_conn_desc desc;
  if (ble_gap_conn_find(event->subscribe.conn_handle, &desc) != 0) {
    return;
  }

  uint16_t subVal = 0;
  if (event->subscribe.cur_notify > 0 && (m_properties & BLECharacteristic::PROPERTY_NOTIFY)) {
    subVal |= NIMBLE_SUB_NOTIFY;
  }
  if (event->subscribe.cur_indicate && (m_properties & BLECharacteristic::PROPERTY_INDICATE)) {
    subVal |= NIMBLE_SUB_INDICATE;
  }

  log_i("New subscribe value for conn: %u val: %u", event->subscribe.conn_handle, subVal);

  if (!event->subscribe.cur_indicate && event->subscribe.prev_indicate) {
    BLEDevice::getServer()->clearIndicateWait(event->subscribe.conn_handle);
  }

  auto it = m_subscribedVec.begin();
  for (; it != m_subscribedVec.end(); ++it) {
    if ((*it).first == event->subscribe.conn_handle) {
      break;
    }
  }

  if (subVal > 0) {
    if (it == m_subscribedVec.end()) {
      m_subscribedVec.push_back({event->subscribe.conn_handle, subVal});
    } else {
      (*it).second = subVal;
    }
  } else if (it != m_subscribedVec.end()) {
    m_subscribedVec.erase(it);
  }

  m_pCallbacks->onSubscribe(this, &desc, subVal);
}

/**
 * @brief Send a notify.
 * A notification is a transmission of up to the first 20 bytes of the characteristic value.  An notification
 * will not block; it is a fire and forget.
 * @return N/A.
 */
void BLECharacteristic::notify(bool is_notification) {
  log_v(">> notify: length: %u", m_value.getValue().length());

  assert(getService() != nullptr);
  assert(getService()->getServer() != nullptr);

  int rc = 0;
  m_pCallbacks->onNotify(this);  // Invoke the notify callback.

  // GeneralUtils::hexDump() doesn't output anything if the log level is not
  // "VERBOSE". Additionally, it is very CPU intensive, even when it doesn't
  // output anything! So it is much better to *not* call it at all if not needed.
  // In a simple program which calls BLECharacteristic::notify() every 50 ms,
  // the performance gain of this little optimization is 37% in release mode
  // (-O3) and 57% in debug mode.
  // Of course, the "#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE" guard
  // could also be put inside the GeneralUtils::hexDump() function itself. But
  // it's better to put it here also, as it is clearer (indicating a verbose log
  // thing) and it allows to remove the "m_value.getValue().c_str()" call, which
  // is, in itself, quite CPU intensive.
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
  GeneralUtils::hexDump((uint8_t *)m_value.getValue().c_str(), m_value.getValue().length());
#endif

