espressif/arduino-esp32/libraries/BLE/src/BLECharacteristic.cpp
  if (getService()->getServer()->getConnectedCount() == 0) {
    log_v("<< notify: No connected clients.");
    m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::ERROR_NO_CLIENT, 0);
    return;
  }

  if (m_subscribedVec.size() == 0) {
    log_v("<< notify: No clients subscribed.");
    m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::ERROR_NO_SUBSCRIBER, 0);
    return;
  }

  if (is_notification) {
    if (!(m_properties & BLECharacteristic::PROPERTY_NOTIFY)) {
      log_v("<< notifications disabled; ignoring");
      m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::ERROR_NOTIFY_DISABLED, 0);  // Invoke the notify callback.
      return;
    }
  } else {
    if (!(m_properties & BLECharacteristic::PROPERTY_INDICATE)) {
      log_v("<< indications disabled; ignoring");
      m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::ERROR_INDICATE_DISABLED, 0);  // Invoke the notify callback.
      return;
    }
  }

  bool reqSec = (m_properties & BLE_GATT_CHR_F_READ_AUTHEN) || (m_properties & BLE_GATT_CHR_F_READ_AUTHOR) || (m_properties & BLE_GATT_CHR_F_READ_ENC);

  for (auto &myPair : m_subscribedVec) {
    uint16_t _mtu = getService()->getServer()->getPeerMTU(myPair.first);

    // check if connected and subscribed
    if (_mtu == 0 || myPair.second == 0) {
      continue;
    }

    if (reqSec) {
      struct ble_gap_conn_desc desc;
      rc = ble_gap_conn_find(myPair.first, &desc);
      if (rc != 0 || !desc.sec_state.encrypted) {
        continue;
      }
    }

    String value = getValue();
    size_t length = value.length();

    if (length > _mtu - 3) {
      log_w("- Truncating to %u bytes (maximum notify size)", _mtu - 3);
    }

    if (is_notification && (!(myPair.second & NIMBLE_SUB_NOTIFY))) {
      log_w("Sending notification to client subscribed to indications, sending indication instead");
      is_notification = false;
    }

    if (!is_notification && (!(myPair.second & NIMBLE_SUB_INDICATE))) {
      log_w("Sending indication to client subscribed to notification, sending notification instead");
      is_notification = true;
    }

    if (!is_notification) {  // is indication
      m_semaphoreConfEvt.take("indicate");
    }

    // don't create the m_buf until we are sure to send the data or else
    // we could be allocating a buffer that doesn't get released.
    // We also must create it in each loop iteration because it is consumed with each host call.
    os_mbuf *om = ble_hs_mbuf_from_flat((uint8_t *)value.c_str(), length);

    if (!is_notification && (m_properties & BLECharacteristic::PROPERTY_INDICATE)) {
      if (!BLEDevice::getServer()->setIndicateWait(myPair.first)) {
        log_e("prior Indication in progress");
        os_mbuf_free_chain(om);
        return;
      }

      rc = ble_gatts_indicate_custom(myPair.first, m_handle, om);
      if (rc != 0) {
        BLEDevice::getServer()->clearIndicateWait(myPair.first);
      }
    } else {
      rc = ble_gatts_notify_custom(myPair.first, m_handle, om);
    }

    if (rc != 0) {
      log_e("<< ble_gatts_%s_custom: rc=%d %s", is_notification ? "notify" : "indicate", rc, GeneralUtils::errorToString(rc));
      m_semaphoreConfEvt.give();
      m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::ERROR_GATT, rc);  // Invoke the notify callback.
      return;
    }

    if (!is_notification) {  // is indication
      if (!m_semaphoreConfEvt.timedWait("indicate", indicationTimeout)) {
        m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::ERROR_INDICATE_TIMEOUT, 0);  // Invoke the notify callback.
      } else {
        auto code = m_semaphoreConfEvt.value();
        if (code == ESP_OK) {
          m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::SUCCESS_INDICATE, code);  // Invoke the notify callback.
        } else {
          m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::ERROR_INDICATE_FAILURE, code);
        }
      }
    } else {
      m_pCallbacks->onStatus(this, BLECharacteristicCallbacks::Status::SUCCESS_NOTIFY, 0);  // Invoke the notify callback.
    }
  }
  log_v("<< notify");
}  // Notify

void BLECharacteristicCallbacks::onRead(BLECharacteristic *pCharacteristic, ble_gap_conn_desc *desc) {
  onRead(pCharacteristic);
}  // onRead

void BLECharacteristicCallbacks::onWrite(BLECharacteristic *pCharacteristic, ble_gap_conn_desc *desc) {
  onWrite(pCharacteristic);
}  // onWrite

void BLECharacteristicCallbacks::onSubscribe(BLECharacteristic *pCharacteristic, ble_gap_conn_desc *desc, uint16_t subValue) {
  log_d(">> onSubscribe: default");
  log_d("<< onSubscribe");
}  // onSubscribe

#endif /* CONFIG_NIMBLE_ENABLED */

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED || CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE */
